In [1]:
import pandas as pd
import numpy as np

In [2]:
students_perfomance = pd.read_csv('https://stepik.org/media/attachments/course/4852/StudentsPerformance.csv')
# по умолчанию, разделитель - ','. Можем указать другой разделитель в аргументе sep=';'

In [3]:
students_perfomance

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [4]:
students_perfomance.head()  # вывод первых 5 строк

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [5]:
students_perfomance.head(10)  # вывод первых 10 строк

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
9,female,group B,high school,free/reduced,none,38,60,50

In [6]:
students_perfomance.tail()  # вывод последних 5 строк

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [7]:
students_perfomance.describe()  # вывод описательной статистики

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [8]:
students_perfomance.dtypes  # вывод типов данных переменных
# object - грубо говоря, строки

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [9]:
students_perfomance.shape  # вывод размера данных - сколько строчек и колонок

(1000, 8)

In [10]:
students_perfomance.groupby('gender').aggregate({'writing score' : 'mean'})
# сгруппировали данные по переменной 'gender' и посчитали среднее значение переменной 'writing score'

        writing score
gender
female      72.467181
male        63.311203

In [11]:
# научимся отбирать нужные колонки и строчки. Отберем первые 5 наблюдений и первые 3 переменные
# у каждой колонки есть имя и порядковвый номер (индекс для обращения)
# у строки тоже есть индексы. В пандасовском датафрейме индексом может выступать другие данные (например, имя студента)

students_perfomance.iloc[0:3, 0:5]  # integer-location позволяет указывать номер позиции,
# на которой находится колонка\строка для того, чтобы получить нужные нам сабсеты данных.

,gender,race/ethnicity,parental level of education,lunch,test preparation course
0,female,group B,bachelor's degree,standard,none
1,female,group C,some college,standard,completed
2,female,group B,master's degree,standard,none

In [12]:
students_perfomance.iloc[[0, 3, 10], [0, 5, -1]]  # выбираем 0, 3, 10 строки и 0, 5, -1 колонки

    gender  math score  writing score
0   female          72             74
3     male          47             44
10    male          58             52

In [13]:
# можно получить доступ к строкам/колонкам используя названия (label)
students_perfomance_with_names = students_perfomance.iloc[[0, 3, 4, 7, 8]]  # передали только позиции строк

# присвоим новому датафрейму содержательные индексы (строк)
students_perfomance_with_names.index = ['Cersei', 'Tywin', 'Gregor', 'Joffrey', 'Ilyn Payne']
students_perfomance_with_names

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
Cersei,female,group B,bachelor's degree,standard,none,72,72,74
Tywin,male,group A,associate's degree,free/reduced,none,47,57,44
Gregor,male,group C,some college,standard,none,76,78,75
Joffrey,male,group B,some college,free/reduced,none,40,43,39
Ilyn Payne,male,group D,high school,free/reduced,completed,64,64,67

In [14]:
# можем отобрать нужные данные используя лейблы
students_perfomance_with_names.loc[['Cersei', 'Joffrey']]  # loc принимает на вход лейблы (название колонок и строк)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
Cersei,female,group B,bachelor's degree,standard,none,72,72,74
Joffrey,male,group B,some college,free/reduced,none,40,43,39

In [15]:
students_perfomance_with_names.loc[['Cersei', 'Joffrey'], ['gender', 'writing score']]

         gender  writing score
Cersei   female             74
Joffrey    male             39

In [16]:
students_perfomance_with_names.iloc[:, 0]  # все строки в первой колонке

Cersei        female
Tywin           male
Gregor          male
Joffrey         male
Ilyn Payne      male
Name: gender, dtype: object

In [17]:
type(students_perfomance_with_names.iloc[:, 0])  # посмотрим что за тип наш поддатафрейм - серия

pandas.core.series.Series

In [18]:
type(students_perfomance_with_names.loc[['Cersei', 'Joffrey'], ['gender', 'writing score']]) # а тут - датафрейм

pandas.core.frame.DataFrame

In [19]:
# Пандасовская серия - одноразмерный массив с некоторыми лейблами-именами.
pd.Series([1, 2, 3])

0    1
1    2
2    3
dtype: int64

In [20]:
pd.Series([1, 2, 3], index = ['Cersei', 'Tywin', 'Gregor'])

Cersei    1
Tywin     2
Gregor    3
dtype: int64

In [ ]:
# пандасовский датафрейм - объединенные в одном месте, пандасовские серии.
# Каждая колонка - серия, которая имеет ключ и хранится под именем, совпаающим с именем переменной.

In [23]:
my_series_1 = pd.Series([1, 2, 3], index = ['Cersei', 'Tywin', 'Gregor'])
my_series_2 = pd.Series([4, 5, 6], index = ['Cersei', 'Tywin', 'Gregor'])

pd.DataFrame({'col_name': my_series_1, 'col_name_2': my_series_2})

        col_name  col_name_2
Cersei         1           4
Tywin          2           5
Gregor         3           6

In [24]:
students_perfomance_with_names['gender']  # получим пандасовскую серию

Cersei        female
Tywin           male
Gregor          male
Joffrey         male
Ilyn Payne      male
Name: gender, dtype: object

In [25]:
students_perfomance_with_names[['gender']]  # а если обратимся так, то получим датафрейм

            gender
Cersei      female
Tywin         male
Gregor        male
Joffrey       male
Ilyn Payne    male

In [28]:
students_perfomance_with_names[['gender']].shape  # 5 строк и 1 колонка

(5, 1)

In [27]:
students_perfomance_with_names['gender'].shape  # 5 спрашиваем про размер не датафрейм, а серию

(5,)

In [ ]:
# Обратите внимание на то, что loc берёт строки включая последнюю, а iloc нет

In [34]:
students_perfomance.dtypes.value_counts() # возвращает серию с числом колонок каждого из типов

object    5
int64     3
dtype: int64

In [35]:
students_perfomance.columns # возвращает коллекцию с названиями колонок

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [36]:
students_perfomance.size # возвращает число ячеек (число строк, умноженное на число столбцов) в df

8000

In [37]:
students_perfomance.index # возвращает коллекцию с индексом всех строк

RangeIndex(start=0, stop=1000, step=1)

In [38]:
students_perfomance.dtypes # возвращает серию с описанием типа каждой колонки

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [39]:
students_perfomance.shape # возвращает кортеж из числа строк и столбцов у df

(1000, 8)

In [ ]:
# students_perfomance.select_dtypes(include=types_to_include, exclude=types_to_exclude)
# возвращает часть датафрэйма, куда были включены колонки с типами, указанными в include,
# или исключены колонки с типами, указанными в exclude

In [40]:
titanic_dataset = pd.read_csv('https://stepik.org/media/attachments/course/4852/titanic.csv')
titanic_dataset.dtypes.value_counts()

object     5
int64      5
float64    2
dtype: int64

In [41]:
titanic_dataset.shape

10692